# TopSketch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptBlend..::..TopSketch Property
SweptBlend Class See Also
---
The top profile sketch of the swept blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Sketch TopSketch { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TopSketch As Sketch
	Get
```

Visual C++
---
```text
public:
property Sketch^ TopSketch {
	Sketch^ get ();
}
```

# Remarks
If the top profile is based on a family symbol, this property is nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
SweptBlend Class
Autodesk.Revit.DB Namespace